pmo-dataset/variations/mermaid_basic/20.mmd
graph LR
	ParallelGateway_3{"+"} --> Task_9["Manager submits order ticket to kitchen"]
	ExclusiveGateway_2{"X"} --> ExclusiveGateway_1{"X"}
	Task_4["Manager takes down the order"] --> ParallelGateway_3
	Task_13["Guest calls room service"] --> Task_4
	ExclusiveGateway_2 --> Task_6["Waiter waits/delays debiting"]
	ParallelGateway_3 --> Task_12["Manager assigns order to waiter"]
	Task_12 --> ParallelGateway_2{"+"}
	ParallelGateway_3 --> ExclusiveGateway_3{"X"}
	ParallelGateway_2 --> Task_5["Waiter prepares nonalcoholic drinks"]
	Task_8["Waiter debits guest's account"] --> EndEvent_1(("end"))
	Task_10["Waiter returns to room-service station"] --> ExclusiveGateway_2
	Task_5 --> ParallelGateway_1{"+"}
	ParallelGateway_2 --> Task_1["Waiter readies cart"]
	ExclusiveGateway_1 --> Task_8
	ExclusiveGateway_4{"X"} --> ParallelGateway_1
	Task_2["Kitchen prepares food"] --> ParallelGateway_1
	ExclusiveGateway_3 --> Task_7["Manager gives order to sommelier"]
	StartEvent_1(("start")) --> Task_13
	Task_11["Waiter delivers order to guest's room"] --> Task_10
	Task_9 --> Task_2
	ParallelGateway_1 --> Task_11
	Task_3["Sommelier fetches wine and prepare alcoholic beverages"] --> ExclusiveGateway_4
	Task_7 --> Task_3
	Task_6 --> ExclusiveGateway_1
	Task_1 --> ParallelGateway_1
	ExclusiveGateway_3 --> ExclusiveGateway_4
